{
  "_name_or_path": "none",
  "architectures": [
    "GOTQwenForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "freeze_vision_tower": false,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "im_end_token": 151858,
  "im_patch_token": 151859,
  "im_start_token": 151857,
  "image_token_len": 256,
  "initializer_range": 0.02,
  "intermediate_size": 2816,
  "max_position_embeddings": 32768,
  "max_window_layers": 21,
  "model_type": "GOT",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_key_value_heads": 16,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.37.2",
  "use_cache": true,
  "use_im_start_end": true,
  "use_sliding_window": false,
  "vision_select_layer": -2,
  "vision_tower": "none",
  "vocab_size": 151860
}
